CavBubbleFsiFoam/exampleCases/bubbleGapToriorg/fluid/constant/solid/rheologyProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      rheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress no;

rheology
{
    type linearElastic;
    rho rho [1 -3 0 0 0 0 0] 2500;
    E E [1 -1 -2 0 0 0 0] 63e9; //Original: 1.4e6;
    nu nu [0 0 0 0 0 0 0] 0.21;
}

// ************************************************************************* //
