CavBubbleFsiFoam/exampleCases/bubbleGapToriorg/fluid/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    default none;
    d2dt2(D) Euler;
}

ddtSchemes
{
    default none;
    ddt(D) Euler;
}


gradSchemes
{
    default none;
    grad(D) leastSquares;
}

divSchemes
{
    default none;
}

laplacianSchemes
{
    default none;
    laplacian(DD,D) Gauss linear corrected;
}

snGradSchemes
{
    default none;
    snGrad(D) corrected;
}

interpolationSchemes
{
    default none;
    interpolate(mu) linear;
    interpolate(lambda) linear;
    interpolate(grad(U)) linear;

    interpolate(grad(D)) linear;
}

// ************************************************************************* //
