CavBubbleFsiFoam/exampleCases/bubbleGapToriorg/fluid/system/solid/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;

method          metis;

globalFaceZones ( interface-zone );

simpleCoeffs
{
    n               (2 1 1);
    delta           0.001;
}

metisCoeffs
{
}

distributed     no;

roots
(
);


// ************************************************************************* //
